/**
 * 
 */
package edu.cmu.lti.nlp.chinese.consts;

import edu.cmu.lti.algorithm.container.SetS;

/**
 * @author nlao
 *
 */
public class Country  {
	public static String[] vs =
		{ "阿富汗", "阿尔巴尼亚", "阿尔及利亚", "安道尔", "安哥拉", "阿拉伯", "阿根廷", "亚美尼亚", "澳大利亚", "澳洲",
			"奥地利", "阿塞拜疆", "巴比伦", "巴哈马", "巴林", "孟加拉国", "巴巴多斯", "巴斯克", "比利时", "贝宁", "百慕大", "不丹",
			"波希米亚", "玻利维亚", "博茨瓦纳", "巴西", "文莱", "乌干达", "保加利亚", "缅甸", "布隆迪", "白俄罗斯", "柬埔寨",
			"喀麦隆", "加拿大", "佛得角", "乍得", "智利", "中国", "哥伦比亚", "科罗拉多", "科摩罗", "刚果", "哥斯达黎加",
			"克里米亚", "克罗地亚", "古巴", "塞浦路斯", "捷克", "捷克和斯洛伐克", "捷克斯洛伐克", "达荷美", "丹麦", "吉布提",
			"多米尼加", "厄瓜多尔", "埃及", "萨尔瓦多", "阿联酋", "赤道几内亚", "爱斯基摩", "爱沙尼亚", "埃塞俄比亚", "斐济", "芬兰",
			"法国", "加蓬", "甘比亚", "格鲁吉亚", "德国", "加纳", "希腊", "格陵兰", "格林纳达", "危地马拉", "几内亚比绍", "几内亚",
			"圭亚那", "海地", "洪都拉斯", "匈牙利", "冰岛", "印度", "印度尼西亚", "伊朗", "伊拉克", "爱尔兰", "以色列", "意大利",
			"牙买加", "日本", "约旦", "哈萨克斯坦", "肯尼亚", "吉尔吉斯斯坦", "朝鲜", "南韩", "北韩", "科威特", "老挝", "拉丁美洲",
			"拉脱维亚", "黎巴嫩", "莱索托", "利比里亚", "利比亚", "列支敦士登", "立陶宛", "卢森堡", "马其顿", "马达加斯加", "马拉维",
			"马来西亚", "马尔代夫", "马里", "马尔他", "毛里塔尼亚", "毛里求斯", "墨西哥", "摩纳哥", "蒙古", "摩洛哥", "莫桑比克",
			"纳米比亚", "瑙鲁", "尼泊尔", "荷兰", "新西兰", "尼加拉瓜", "尼日利亚", "尼日尔", "北朝鲜", "挪威", "阿曼", "巴基斯坦",
			"巴勒斯坦", "巴拿马", "巴布亚新几内亚", "巴布亚", "巴拉圭", "波斯", "秘鲁", "菲律宾", "波兰", "波利尼西亚", "葡萄牙",
			"普鲁士", "波多黎各", "卡塔尔", "罗得岛", "罗得西亚", "罗马尼亚", "俄罗斯", "卢旺达", "萨摩亚", "圣马力诺",
			"圣多美和普林西比", "沙特阿拉伯", "斯堪的纳维亚", "苏格兰", "塞内加尔", "塞尔维亚", "塞舌尔", "塞拉利昂", "锡金", "新加坡",
			"僧伽罗", "斯洛伐克", "斯洛文尼亚", "所罗门群岛", "索马里", "南非", "韩国", "西班牙", "斯里兰卡", "苏丹", "苏里南",
			"斯威士兰", "瑞典", "瑞士", "叙利亚", "台湾", "塔吉克斯坦", "坦桑尼亚", "泰国", "西藏", "多哥", "汤加",
			"特立尼达和多巴哥", "突尼斯", "土耳其", "土库曼斯坦", "土耳其", "英国", "联合国", "苏联", "美国", "乌干达", "乌克兰",
			"乌拉圭", "乌兹别克斯坦", "委内瑞拉", "越南", "西萨摩亚", "也门", "南斯拉夫", "扎伊尔", "赞比亚", "津巴不韦", "巴哈马",
			"科摩罗", "象牙海岸", "阿拉伯联合酋长国", "阿爾巴尼亞", "剛果共和國", "阿爾及利亞", "丹麥", "安哥拉", "多明尼加", "安圭拉",
			"多米尼克", "阿根廷", "厄瓜多爾", "亞美尼亞", "埃及", "阿路巴", "薩爾瓦多", "澳大利亞", "厄利垂亞", "奧地利", "愛沙尼亞",
			"亞塞拜然", "衣索匹亞", "巴哈馬", "斐濟", "巴林", "芬蘭", "孟加拉", "法屬玻里尼西亞", "法國", "巴貝多", "加彭",
			"白俄羅斯", "喬治亞", "比利時", "德國", "貝里斯", "迦納", "貝南", "直布羅陀", "百慕達", "英國", "不丹", "希臘",
			"玻利維亞", "格瑞那達", "波希尼亞及赫塞哥維那", "瓜地馬拉", "波札那", "幾內亞", "巴西", "蓋亞那", "汶萊", "海地",
			"保加利亞", "宏都拉斯", "布吉納法索", "香港", "蒲隆地", "匈牙利", "柬埔寨", "冰島", "喀麥隆", "印度", "加拿大", "印尼",
			"依朗", "伊拉克", "中非共和國", "愛爾蘭", "查德", "以色列", "智利", "義大利", "中國大陸", "牙買加", "哥倫比亞", "日本",
			"剛果", "約旦", "科克群島", "肯亞", "哥斯大黎加", "韓國", "象牙海岸", "科威特", "克羅埃西亞", "寮國", "塞浦路斯",
			"拉脫維亞", "捷克", "賴索托", "盧森堡", "聖露西亞", "澳門", "聖文森及格瑞那丁", "馬其頓", "聖多美及普林西比", "馬達加斯加",
			"沙烏地阿拉伯", "馬拉威", "塞內加爾", "馬來西亞", "塞席爾", "馬爾地夫", "獅子山", "馬利", "新加坡", "馬爾他", "斯洛伐克",
			"模里西斯", "斯洛維尼亞", "茅利塔尼亞", "索羅門群島", "墨西哥", "索馬利亞", "摩爾多瓦", "南非", "蒙古", "西班牙", "摩洛哥",
			"斯里蘭卡", "緬甸", "蘇丹", "納米比亞", "蘇利南", "諾魯", "尼泊爾", "瑞典", "荷蘭", "瑞士", "新喀里多尼亞", "敘利亞",
			"紐西蘭", "坦尚尼亞", "尼日", "泰國", "奈及利亞", "多哥", "挪威", "千里達及托貝哥", "阿曼", "突尼西亞", "巴基斯坦",
			"土耳其", "巴拿馬", "烏干達", "巴布亞紐幾內亞", "烏克蘭", "巴拉圭", "阿拉伯聯合大公國", "秘魯", "美國", "菲律賓", "烏拉圭",
			"波蘭", "委內瑞拉", "葡萄牙", "越南", "卡達", "西薩摩亞", "羅馬尼亞", "葉門", "俄羅斯", "尚比亞", "盧安達", "辛巴威",
			"聖克里斯多福及尼維斯", "馬紹爾" };	
	public static SetS m = new SetS();
	static {m.load(vs);	}	
}
