package edu.cmu.lti.nlp.chinese.consts;

import edu.cmu.lti.algorithm.container.SetS;

public class Province {

	public static String[] vs = { "河北", "河南", "山西", "陕西", "山东", "湖北", "湖南", "辽宁", "吉林", "黑龙江 ", "江苏",
			"浙江", "安徽", "福建", "江西", "广东", "广西", "四川", "贵州", "云南", "内蒙古", "西藏", "新疆", "甘肃", "青海",
			"宁夏", "台湾", "海南", "河北省 ", "河南省", "山西省", "陕西省", "山东省", "湖北省", "湖南省", "辽宁省", "吉林省",
			"黑龙江省 ", "江苏省 ", "浙江省", "安徽省", "福建省", "江西省", "广东省", "广西省", "四川省", "贵州省", "云南省", "甘肃省",
			"青海省 ", "台湾省", "海南省", "内蒙古自治区", "西藏自治区", "新疆自治区", "宁夏自治区", "广西壮族自治区", "内蒙古少数民族自治区",
			"西藏藏族自治区", "新疆维吾尔族自治区", "宁夏回族自治区" };
	public static SetS m = new SetS();
	static {m.load(vs);	}	
}
